---
type: DoubleClickOptions
namespace: Autodesk.Revit.UI
version: 2024
members: 8
tags: [revit-api, class]
---

# DoubleClickOptions

`Autodesk.Revit.UI.DoubleClickOptions` · Revit 2024 · 8 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Dispose | — | `public void Dispose ()` |
| Method | GetAction | 2016 | `public DoubleClickAction GetAction ( DoubleClickTarget target )` |
| Method | GetDoubleClickOptions | 2016 | `public static DoubleClickOptions GetDoubleClickOptions ()` |
| Method | GetRenameOnSlowDoubleClickInProjectBrowser | 2016 | `public bool GetRenameOnSlowDoubleClickInProjectBrowser ()` |
| Method | IsSupportedAction | 2016 | `public bool IsSupportedAction ( DoubleClickTarget target , DoubleClickAction action )` |
| Method | SetAction | 2016 | `public void SetAction ( DoubleClickTarget target , DoubleClickAction action )` |
| Method | SetRenameOnSlowDoubleClickInProjectBrowser | 2016 | `public void SetRenameOnSlowDoubleClickInProjectBrowser ( bool bRenameOnSlowDoubleClickInProjectBrowser )` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |